## Plan Result (production - TerraformPlanApply)




<pre><code>Plan: 39 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault.baubais_kv
  * azurerm_key_vault_secret.synapse_sql_password
  * azurerm_key_vault_secret.synapse_sql_username
  * azurerm_linux_function_app.funcapp
  * azurerm_role_assignment.DLRM_sa
  * azurerm_role_assignment.baubaiscontributor
  * azurerm_role_assignment.function_contributor
  * azurerm_role_assignment.synapse_sa
  * azurerm_role_assignment.teamcontributor
  * azurerm_route_table.this
  * azurerm_service_plan.asp
  * azurerm_storage_account.adf_juror_sa
  * azurerm_storage_data_lake_gen2_filesystem.this
  * azurerm_subnet.adf_juror_subnet1
  * azurerm_subnet.function_subnet3
  * azurerm_subnet_route_table_association.this
  * azurerm_synapse_firewall_rule.allowall
  * azurerm_synapse_role_assignment.anotherone
  * azurerm_synapse_role_assignment.creduser
  * azurerm_synapse_role_assignment.dlrm
  * azurerm_synapse_role_assignment.this
  * azurerm_synapse_spark_pool.this[0]
  * azurerm_synapse_sql_pool.this[0]
  * azurerm_synapse_workspace.this
  * azurerm_synapse_workspace_aad_admin.aad
  * azurerm_virtual_network.adf_juror_vnet
  * azurerm_virtual_network_peering.hub-to-juror
  * azurerm_virtual_network_peering.juror-to-hub
  * random_password.synapse_sql_password
  * module.datafactory.azurerm_data_factory.this
  * module.datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.datafactory.azurerm_resource_group.new[0]
  * module.storage.azapi_update_resource.defender_settings
  * module.storage.azurerm_storage_account.storage_account
  * module.storage.azurerm_storage_container.container[&#34;data&#34;]
  * module.storage.random_string.storage_account_random_string
  * module.storage.time_rotating.rotate
  * module.storage.time_static.pim_expiry
  * module.storage.time_static.pim_start




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.baubais_kv will be created
  + resource "azurerm_key_vault" "baubais_kv" {
      + access_policy                 = [
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "ffc3a97e-f4fc-4866-a98a-8ba04923b0a8"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "0ad7e647-a69f-4602-801e-c376779334c2"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "ManageContacts",
                  + "ManageIssuers",
                  + "GetIssuers",
                  + "ListIssuers",
                  + "SetIssuers",
                  + "DeleteIssuers",
                ]
              + key_permissions         = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "GetRotationPolicy",
                  + "SetRotationPolicy",
                  + "Rotate",
                ]
              + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ]
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "baubais-prod-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "baubais-data-factory-rg-prod"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.synapse_sql_password will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "baubais-synapse-sql-password-prod"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.synapse_sql_username will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "baubais-synapse-sql-username-prod"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.funcapp will be created
  + resource "azurerm_linux_function_app" "funcapp" {
      + app_settings                                   = {
          + "BUILD_FLAGS"                    = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"              = "true"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT" = "1"
          + "XDG_CACHE_HOME"                 = "/tmp/.cache"
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "baubais-prod-functionapp"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "baubais-data-factory-rg-prod"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "synapsebaubaisprod"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.12"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_role_assignment.DLRM_sa will be created
  + resource "azurerm_role_assignment" "DLRM_sa" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.baubaiscontributor will be created
  + resource "azurerm_role_assignment" "baubaiscontributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.function_contributor will be created
  + resource "azurerm_role_assignment" "function_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.synapse_sa will be created
  + resource "azurerm_role_assignment" "synapse_sa" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.teamcontributor will be created
  + resource "azurerm_role_assignment" "teamcontributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_route_table.this will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rt-adf-function-prod"
      + resource_group_name           = "baubais-data-factory-rg-prod"
      + route                         = [
          + {
              + address_prefix         = "10.144.0.0/18"
              + name                   = "ss-prod-vnet"
              + next_hop_in_ip_address = "10.11.8.36"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "baubais-prod-asp"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "baubais-data-factory-rg-prod"
      + sku_name                     = "B1"
      + tags                         = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.adf_juror_sa will be created
  + resource "azurerm_storage_account" "adf_juror_sa" {
      + access_tier                        = (known after apply)
      + account_kind                       = "BlockBlobStorage"
      + account_replication_type           = "LRS"
      + account_tier                       = "Premium"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "baubaisadfsaprod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "baubais-data-factory-rg-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_data_lake_gen2_filesystem.this will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + default_encryption_scope = (known after apply)
      + group                    = (known after apply)
      + id                       = (known after apply)
      + name                     = "baubais-storage-data-lake-prod"
      + owner                    = (known after apply)
      + storage_account_id       = (known after apply)

      + ace (known after apply)
    }

  # azurerm_subnet.adf_juror_subnet1 will be created
  + resource "azurerm_subnet" "adf_juror_subnet1" {
      + address_prefixes                              = [
          + "10.1.2.0/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "baubais-adf-privateendpoints-prod"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "baubais-data-factory-rg-prod"
      + virtual_network_name                          = "baubais-adf-vnet-prod"
    }

  # azurerm_subnet.function_subnet3 will be created
  + resource "azurerm_subnet" "function_subnet3" {
      + address_prefixes                              = [
          + "10.1.2.24/29",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "function-privateendpoints"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "baubais-data-factory-rg-prod"
      + virtual_network_name                          = "baubais-adf-vnet-prod"

      + delegation {
          + name = "function-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_subnet_route_table_association.this will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_synapse_firewall_rule.allowall will be created
  + resource "azurerm_synapse_firewall_rule" "allowall" {
      + end_ip_address       = "255.255.255.255"
      + id                   = (known after apply)
      + name                 = "AllowAll"
      + start_ip_address     = "0.0.0.0"
      + synapse_workspace_id = (known after apply)
    }

  # azurerm_synapse_role_assignment.anotherone will be created
  + resource "azurerm_synapse_role_assignment" "anotherone" {
      + id                   = (known after apply)
      + principal_id         = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + role_name            = "Synapse Administrator"
      + synapse_workspace_id = (known after apply)
    }

  # azurerm_synapse_role_assignment.creduser will be created
  + resource "azurerm_synapse_role_assignment" "creduser" {
      + id                   = (known after apply)
      + principal_id         = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + role_name            = "Synapse Credential User"
      + synapse_workspace_id = (known after apply)
    }

  # azurerm_synapse_role_assignment.dlrm will be created
  + resource "azurerm_synapse_role_assignment" "dlrm" {
      + id                   = (known after apply)
      + principal_id         = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + role_name            = "Synapse Contributor"
      + synapse_workspace_id = (known after apply)
    }

  # azurerm_synapse_role_assignment.this will be created
  + resource "azurerm_synapse_role_assignment" "this" {
      + id                   = (known after apply)
      + principal_id         = "4d0554dd-fe60-424a-be9c-36636826d927"
      + role_name            = "Synapse Contributor"
      + synapse_workspace_id = (known after apply)
    }

  # azurerm_synapse_spark_pool.this[0] will be created
  + resource "azurerm_synapse_spark_pool" "this" {
      + cache_size                          = 100
      + compute_isolation_enabled           = false
      + dynamic_executor_allocation_enabled = false
      + id                                  = (known after apply)
      + name                                = "sparkprod"
      + node_count                          = (known after apply)
      + node_size                           = "Small"
      + node_size_family                    = "MemoryOptimized"
      + session_level_packages_enabled      = false
      + spark_events_folder                 = "/events"
      + spark_log_folder                    = "/logs"
      + spark_version                       = "3.4"
      + synapse_workspace_id                = (known after apply)
      + tags                                = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + auto_pause {
          + delay_in_minutes = 15
        }

      + auto_scale {
          + max_node_count = 10
          + min_node_count = 3
        }
    }

  # azurerm_synapse_sql_pool.this[0] will be created
  + resource "azurerm_synapse_sql_pool" "this" {
      + collation                 = (known after apply)
      + create_mode               = "Default"
      + geo_backup_policy_enabled = true
      + id                        = (known after apply)
      + name                      = "baubais_synapse_sql_prod"
      + sku_name                  = "DW100c"
      + storage_account_type      = "GRS"
      + synapse_workspace_id      = (known after apply)
      + tags                      = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # azurerm_synapse_workspace.this will be created
  + resource "azurerm_synapse_workspace" "this" {
      + azuread_authentication_only          = false
      + connectivity_endpoints               = (known after apply)
      + data_exfiltration_protection_enabled = false
      + id                                   = (known after apply)
      + location                             = "uksouth"
      + managed_resource_group_name          = "baubais-synapse"
      + managed_virtual_network_enabled      = true
      + name                                 = "baubais-synapse-prod"
      + public_network_access_enabled        = true
      + resource_group_name                  = "baubais-data-factory-rg-prod"
      + sql_administrator_login              = "sqladminuser"
      + sql_administrator_login_password     = (sensitive value)
      + sql_identity_control_enabled         = true
      + storage_data_lake_gen2_filesystem_id = (known after apply)
      + tags                                 = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + github_repo {
          + account_name    = "hmcts"
          + branch_name     = "main"
          + git_url         = "https://github.com"
          + repository_name = "juror-er-infra"
          + root_folder     = "/synapse"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + timeouts {
          + create = "2h"
          + delete = "2h"
        }
    }

  # azurerm_synapse_workspace_aad_admin.aad will be created
  + resource "azurerm_synapse_workspace_aad_admin" "aad" {
      + id                   = (known after apply)
      + login                = "DTS Platform Operations SC"
      + object_id            = "4d0554dd-fe60-424a-be9c-36636826d927"
      + synapse_workspace_id = (known after apply)
      + tenant_id            = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_virtual_network.adf_juror_vnet will be created
  + resource "azurerm_virtual_network" "adf_juror_vnet" {
      + address_space       = [
          + "10.1.0.0/27",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "baubais-adf-vnet-prod"
      + resource_group_name = "baubais-data-factory-rg-prod"
      + subnet              = (known after apply)
      + tags                = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # azurerm_virtual_network_peering.hub-to-juror will be created
  + resource "azurerm_virtual_network_peering" "hub-to-juror" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hmcts-hub-prod-int-to-baubais-adf-vnet-prod"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "hmcts-hub-prod-int"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "hmcts-hub-prod-int"
    }

  # azurerm_virtual_network_peering.juror-to-hub will be created
  + resource "azurerm_virtual_network_peering" "juror-to-hub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "baubais-adf-vnet-prod-to-hmcts-hub-prod-int"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int"
      + resource_group_name                    = "baubais-data-factory-rg-prod"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "baubais-adf-vnet-prod"
    }

  # random_password.synapse_sql_password will be created
  + resource "random_password" "synapse_sql_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 4
      + min_numeric      = 4
      + min_special      = 0
      + min_upper        = 4
      + number           = true
      + numeric          = true
      + override_special = "#$%&@()_[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.datafactory.azurerm_data_factory.this will be created
  + resource "azurerm_data_factory" "this" {
      + id                              = (known after apply)
      + location                        = "uksouth"
      + managed_virtual_network_enabled = true
      + name                            = "baubais-data-factory-prod"
      + public_network_enabled          = false
      + resource_group_name             = "baubais-data-factory-rg-prod"
      + tags                            = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + github_configuration {
          + account_name       = "hmcts"
          + branch_name        = "main"
          + git_url            = "https://github.com"
          + publishing_enabled = true
          + repository_name    = "juror-er-infra"
          + root_folder        = "/adf"
        }
    }

  # module.datafactory.azurerm_data_factory_integration_runtime_azure.this will be created
  + resource "azurerm_data_factory_integration_runtime_azure" "this" {
      + cleanup_enabled         = true
      + compute_type            = "General"
      + core_count              = 8
      + data_factory_id         = (known after apply)
      + id                      = (known after apply)
      + location                = "autoresolve"
      + name                    = "AutoResolveIntegrationRuntime"
      + time_to_live_min        = 0
      + virtual_network_enabled = true
    }

  # module.datafactory.azurerm_resource_group.new[0] will be created
  + resource "azurerm_resource_group" "new" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "baubais-data-factory-rg-prod"
      + tags     = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.storage.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "synapsebaubaisprod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "baubais-data-factory-rg-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage.azurerm_storage_container.container["data"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "data"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "synapsebaubaisprod"
    }

  # module.storage.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.storage.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 39 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":21,"Program":"tfcmt","SHA1":"","Target":"production - TerraformPlanApply","Vars":{}} -->